In [2]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [3]:
df.loc[1, 'Age'] = 32 # df.loc[행, 열] = 값
df

      Name  Age         City
0    Alice   25     New York
1      Bob   32  Los Angeles
2  Charlie   35      Chicago

In [4]:
df.iloc[2, 2] = 'San Francisco' # df.iloc[행인데스, 열인덱스] = 값
df

      Name  Age           City
0    Alice   25       New York
1      Bob   32    Los Angeles
2  Charlie   35  San Francisco

In [5]:
df.loc[df['Name']=='Bob', 'Age'] = 10 # name이 bob인 값의 Age값을 10d으로 변경
df

      Name  Age           City
0    Alice   25       New York
1      Bob   10    Los Angeles
2  Charlie   35  San Francisco

In [6]:
df.iloc[:, :-1]

      Name  Age
0    Alice   25
1      Bob   10
2  Charlie   35

In [9]:
df.iloc[:, :]

      Name  Age           City
0    Alice   25       New York
1      Bob   10    Los Angeles
2  Charlie   35  San Francisco

In [22]:
df.iloc[:-1, 2]

0       New York
1    Los Angeles
Name: City, dtype: object